; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
    (:requirements :equality :typing)
    (:types
        block - object
        object
    )

    (:constants
        
    )

    (:predicates
        (on ?x1 - block ?x2 - block)
        (ontable ?x1 - block)
        (clear ?x1 - block)
        (handempty )
        (holding ?x1 - block)
    )

    (:functions
        
    )

    

    
    (:action pick-up
     :parameters (?x - block)
     :precondition (and (clear ?x) (ontable ?x) (handempty ))
     :effect (and
        (not (ontable ?x))
        (not (clear ?x))
        (not (handempty ))
        (holding ?x))
    )


    (:action put-down
     :parameters (?x - block)
     :precondition (holding ?x)
     :effect (and
        (not (holding ?x))
        (clear ?x)
        (handempty )
        (ontable ?x))
    )


    (:action stack
     :parameters (?x - block ?y - block)
     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
     :effect (and
        (not (holding ?x))
        (not (clear ?y))
        (clear ?x)
        (handempty )
        (on ?x ?y))
    )


    (:action unstack
     :parameters (?x - block ?y - block)
     :precondition (and (on ?x ?y) (clear ?x) (handempty ) (not (= ?x ?y)))
     :effect (and
        (holding ?x)
        (clear ?y)
        (not (clear ?x))
        (not (handempty ))
        (not (on ?x ?y)))
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem blocks_words)
    (:domain BLOCKS)

    (:objects
        a c d e o p r w - block
    )

    (:init
        (handempty )
        (clear c)
        (clear a)
        (clear o)
        (ontable e)
        (ontable p)
        (ontable w)
        (on o r)
        (on a e)
        (on r p)
        (on d w)
        (on c d)
    )

    (:goal
        (and (clear d) (ontable w) (on d r) (on r a) (on a w))
    )

    
    
    
)

; plan
1. (unstack o r)
   deleted: (clear o) (handempty) (on o r)
   added: (holding o) (clear r)
   goals met: 1 of 5
2. (put-down o)
   deleted: (holding o)
   added: (clear o) (handempty) (ontable o)
   goals met: 1 of 5
3. (unstack c d)
   deleted: (clear c) (handempty) (on c d)
   added: (holding c) (clear d)
   goals met: 2 of 5
4. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 2 of 5
5. (unstack d w)
   deleted: (clear d) (handempty) (on d w)
   added: (holding d) (clear w)
   goals met: 1 of 5
6. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 2 of 5
7. (unstack a e)
   deleted: (clear a) (handempty) (on a e)
   added: (holding a) (clear e)
   goals met: 2 of 5
8. (stack a w)
   deleted: (holding a) (clear w)
   added: (clear a) (handempty) (on a w)
   goals met: 3 of 5
9. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 3 of 5
10. (stack e c)
   deleted: (holding e) (clear c)
   added: (clear e) (handempty) (on e c)
   goals met: 3 of 5
11. (unstack r p)
   deleted: (clear r) (handempty) (on r p)
   added: (holding r) (clear p)
   goals met: 3 of 5
12. (stack r a)
   deleted: (holding r) (clear a)
   added: (clear r) (handempty) (on r a)
   goals met: 4 of 5
13. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 3 of 5
14. (stack d r)
   deleted: (holding d) (clear r)
   added: (clear d) (handempty) (on d r)
   goals met: 5 of 5
